<template>
    <div id="agreement">
      <van-nav-bar
        :left-text="titleName"
        style="background-color: #FFF;text-align: left;border: 0"
        left-arrow
        @click-left="onClickLeft"
      />
      <div id="pageStyle">
        <p>
          感谢您使用国国侃球手机客户端（下称：国国侃球），国国侃球是一个体育爱好者的数据平台。请您仔细阅读以下条款并选择接受或不接受本协议（未成年人应在法定监护人陪同下审阅和履行，未成年人行使和履行本协议项下的权利和义务视为已获得了法定监护人的认可）。用户应认真阅读本协议的全部条款，特别是其中免除或者限制国国侃球责任的免责声明条款以及限制用户权利的条款。除非您接受本协议条款，否则您无权下载、安装或使用国国侃球及其相关服务。您的安装使用行为将视为对本协议的接受，并同意接受本协议各项条款的约束。
        </p>
        <p>1、协议的接受</p>
        <p>1.1 在本协议中，"用户"或"您"是指通过国国侃球提供的获取软件授权的途径获得软件授权许可和/或软件产品的个人或单一实体；"我们"指国国侃球；"服务"指国国侃球所有相关服务。</p>
        <p>1.2 当您在使用国国侃球时，或进行相关注册，或接受相关服务时，代表您已经同意遵守并受本协议约束，并同意遵守中国相关法律法规。</p>
        <p>1.3 为更好地为您服务，我们若更新本协议或相关通知，将在国国侃球消息中公示，请您留意国国侃球的消息通知。</p>
        <p>1.4 如果您不同意本协议的相关条款，请您立即停止使用国国侃球及其服务。</p>
        <p>2、用户注册</p>
        <p>2.1 当您注册国国侃球时，您应当提供完整、准确、真实的注册信息。如果您没有提供完整、准确、真实的注册信息，因此而导致您的权利受损，国国侃球免责。</p>
        <p>2.2 请您妥善保管您的密码和帐号，并对其账户中的所有活动和事件承担全部责任。如果用户未保管好自己的帐号和密码而遭受损失或对国国侃球、其他用户或任何第三方造成损害的，用户应独自承担全部责任。</p>
        <p>2.3 当您的账户、用户名及密码非经您本人授权被使用时，您应立即修改密码或通知国国侃球。对于任何人利用用户账号和密码所进行的任何行为及因此而产生的任何损失或损害，用户应独自承担完全的责任。</p>
        <p>2.4 您直接或通过各类方式（如RSS源和站外API引用等）间接使用国国侃球服务和数据的行为，都被视作已无条件接受本协议全部内容；若您对本协议任何条款存在异议，请停止使用国国侃球所提供的全部服务。</p>
        <p>3、用户信息保护</p>
        <p>3.1 您在注册帐号时和使用国国侃球时，我们将采集包括注册信息、非个人化信息等用户信息。</p>
        <p>3.2 用户通过国国侃球发表的信息为公开信息，其他第三方均可以通过国国侃球获取用户发表的信息，并由第三方单独对此行为承担法律责任；任何用户不愿被其他第三人获知的信息都不应该在国国侃球上进行发表。</p>
        <p>4、用户使用限制</p>
        <p>4.1 您不得将我们的服务标志、注册商标、文档及图片等从其原来的位置上移除或做任何修改。</p>
        <p>4.2 您不得实施侵犯国国侃球所涉及的知识产权之行为。</p>
        <p>4.3 不得注册恶意的用户账号或利用国国侃球账号，进行违法活动，以及干扰、欺骗、损坏国国侃球用户。</p>
        <p>4.4 不得在国国侃球内容或您上传的资料中安装插件或软件，以上传、链接、跳转、推广非国国侃球授权的资料。</p>
        <p>4.5 不得利用国国侃球上传违反法律、行政法规、互联网管理方面的部门规章之内容，包括但不限于：宣传暴力、色情、破坏民族团结、侮辱、诽谤他人之内容。</p>
        <p>4.6 不得利用国国侃球或对国国侃球进行传播病毒、窃取他人的帐号及密码、侵犯他人商业秘密及其他知识产权之行为。</p>
        <p>4.7 对于前述4.1到4.6条等违反国家法律、行政法规的行为，用户同意独立承担全部责任，国国侃球有权在不通知您的情况下删除非法信息，并有权对您的帐号进行关闭或注销，不再提供任何服务，且不退还您已经支付的所有费用；由此造成国国侃球损失的，国国侃球有权要求用户给与相应的赔偿，包括但不限于国国侃球被国家机关予以行政处罚或者被第三方通过诉讼或其他方式索赔等情形，赔偿范围包括、但不限于罚款、赔偿金以及国国侃球支付的相应诉讼费、律师费等。</p>
        <p>5、免责声明</p>
        <p>5.1 国国侃球不能对用户发表的评论和帖子的正确性进行保证。</p>
        <p>5.2 国国侃球与第三方进行合作，对于国国侃球与第三方的链接、以及第三方提供的服务、您访问该第三方时的交易帐号及密码安全问题，国国侃球不承担任何责任，亦不予任何保证。</p>
        <p>5.3 您或者其他用户在国国侃球发表的内容仅表明其个人立场和观点，并不代表国国侃球的立场和观点。作为内容的发表者，需自行对发表内容负责，因所发表内容引发的一切纠纷，由该内容的发表者承担全部法律责任及连带责任，国国侃球免责。</p>
        <p>5.4 国国侃球不保证网络服务一定能满足用户的要求，也不能保证网络服务不会中断，对网络服务的及时性、安全性、准确性也不作保证。</p>
        <p>5.5 您在向国国侃球发表内容时，应事先做好备份，因信息丢失使您遭受损失的，国国侃球免责。</p>
        <p>5.6 因政府或司法行为导致您不能使用国国侃球，我们将免责。</p>
        <p>5.7 如果有发现国国侃球中内容侵犯您的知识产权或其他权益，请联系国国侃球客服。</p>
        <p>5.8 用户自国国侃球或经国国侃球获得的任何建议或信息（无论书面或口头形式）均不构成用户协议明确规定以外的任何保证。</p>
        <p>5.9 用户明确了解并同意，使用国国侃球或从国国侃球下载或以其他方式获得任何资料的任何风险和后果（包括、但不限于受到第三方侵权或对第三方造成侵权或因任何资料的下载而导致的用户设备、电脑系统的任何损坏或数据丢失等后果）由用户独自承担，国国侃球不承担任何责任。</p>
        <p>6、所有权和知识产权声明</p>
        <p>6.1 国国侃球是为体育迷打造的专业数据平台，授权的管理员将依据协议内容对注册国国侃球的用户和发布在国国侃球的内容进行管理。采取的措施包括但不限于更改或删除用户发布的内容、暂停或终止用户使用国国侃球的权利。</p>
        <p>6.2国国侃球涉及到的国国侃球的所有权以及相关软件的知识产权归北京铭宇宏通科技有限公司所有，用户不得侵犯其知识产权。</p>
        <p>6.3 国国侃球提供的网络服务中的内容，未经相关权利人的同意，上述内容不得在任何平台被直接或间接发布、使用、处于发布或使用目的的改写或再发行，或被用于其他商业目的。</p>
        <p>6.4 国国侃球有权但无义务对用户发布的内容进行审核，有权根据相关证据结合《侵权责任法》、《信息网络传播权保护条例》等法律法规及国国侃球原则对侵权信息进行处理。</p>
        <p>7、通知送达</p>
        <p>本协议项下国国侃球对于用户所有的通知均可通过公告、电子邮件、手机短信或常规的信件传送等方式进行；该通知于发送之日视为已送达收件人。</p>
        <p>8、本协议的效力</p>
        <p>本协议中的任何条款无效不影响本协议的其余条款的法律效力。</p>
        <p>9、个人隐私</p>
        <p>国国侃球会通过技术手段、强化内部管理等办法充分保护用户的个人隐私信息，除法律或有法律赋予权限的政府部门要求或事先得到用户明确授权等原因外，国国侃球保证不对外公开或向第三方透露个人隐私信息，或用户在使用服务时存储的非公开内容。同时，为了向用户提供更好的体验和服务质量，国国侃球可能会自行收集使用或向第三方提供用户的非个人隐私信息</p>
        <p>10、法律适用及争议解决</p>
        <p>10.1本协议的订立、执行、解释及纠纷、争议的解决均适用中国法律，受中国法律管辖。</p>
        <p>10.2因本协议发生任何纠纷，双方应协商一致解决；协商不成的，双方均可向北京铭宇宏通科技有限公司所在地的人民法院提起诉讼。</p>
        <p>11、国国侃球帐号有效期</p>
        <p>用户清楚知悉国国侃球帐号存在有效期，并同意不定时登录使用国国侃球帐号以延续其有效期。</p>
        <p>11.1 如果用户的国国侃球帐号下不存在国国侃球充值幸运币余数，而该帐号连续180天没有登录，则北京铭宇宏通科技有限公司有权删除该国国侃球帐号；当帐号被删除后，该国国侃球帐号的所有资料以及与该国国侃球帐号相关的全部服务资料和数据（包括但不限于国国侃球充值幸运币余额度、国国侃球赠送幸运币余额度，国国侃球帐号信息，等）将同时删除，且不可恢复。该帐号名有可能会被新的用户注册。</p>
        <p>11.2 如果用户的国国侃球帐号下存在国国侃球充值幸运币余数，而该帐号连续180天没有登录，北京铭宇宏通科技有限公司有权立即终止该等帐号下的数据信息内容删除；如该帐号连续365天没有登录，则该帐号下的国国侃球充值幸运币余数自该帐号最后一次登录之日起的第365天24时到期作废，北京铭宇宏通科技有限公司有权删除该国国侃球帐号。当帐号被删除后，该国国侃球帐号的所有资料以及与该国国侃球帐号相关的全部服务资料和数据（包括但不限于国国侃球充值幸运币余额度、国国侃球赠送幸运币余额度，国国侃球帐号信息，等）将同时删除，且不可恢复。该帐号名有可能会被新的用户注册。</p>
        <p>12、协议修改</p>
        <p>12.1根据互联网的发展和有关法律、法规及规范性文件的变化，或者因业务发展的需要，国国侃球有权对本协议的条款作出修改或变更，一旦本协议内容发生变动，国国侃球将会直接在国国侃球网站上公布修改之后的协议内容，该公布行为视为国国侃球已经通知用户修改内容。国国侃球可采用电子邮件或者手机短信的传送方式，提示用户协议条款的修改、服务变更、或其他重要事项。</p>
        <p>12.2如果不同意国国侃球对本协议相关条款所做的修改，用户有权并应当停止使用国国侃球。如果用户继续使用国国侃球，则视为用户同意接受国国侃球对本协议相关条款所做的修改。</p>
      </div>
    </div>
</template>

<script>
    export default {
      name: "AgreementPage",
      data(){
        return{
          titleName:'用户协议'
        }
      },
      methods:{
        onClickLeft(){
          this.$router.back()
        },
      },
      mounted(){
        // var webview = plus.webview.currentWebview();
        // plus.key.addEventListener('backbutton', function() {
        //   webview.canBack(function(e) {
        //     if(e.canBack) {
        //       webview.back();
        //     } else {
        //       webview.close(); //hide,quit
        //       //plus.runtime.quit();
        //     }
        //   })
        // });
      }
    }
</script>

<style scoped lang="less">
  #agreement{
    width: 100%;
    min-height: 100%;
    background: #FFF;
    font-family: SimSuncss;
    .van-nav-bar{
      width: 100%;
      position: fixed;
      top:0;
      left: 0;
      .van-nav-bar__text {
        color:#000 !important;
        font-size:16px;
        letter-spacing: 1px;

      }
      .van-icon{
        color:#000 !important;
      }
    }

    #pageStyle{
      width: 90%;
      padding-top: 26px;
      margin: 20px auto;
      font-size:13px;
      letter-spacing: 1px;
    }
  }
</style>
